# MovesWithGridParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MovesWithGridParam Property
ParameterTypeId Class See Also
---
"Moves With Grids": Disable attachment from grids.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MovesWithGridParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MovesWithGridParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MovesWithGridParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace